import re
#тест-лог сгенерирован ии
text = """
[2023-10-01 12:00:01] INFO  - Сервер запущен. Версия: 1.0.3
[2023-10-01 12:00:02] INFO  - Инициализация базы данных...
[2023-10-01 12:00:05] SUCCESS - База данных успешно инициализирована.
[2023-10-01 12:00:06] INFO  - Запуск службы обработки запросов...
[2023-10-01 12:00:10] INFO  - Служба обработки запросов запущена на порту 8080.
[2023-10-01 12:01:15] WARNING - Высокая нагрузка на сервер. Загрузка CPU: 85%
[2023-10-01 12:01:20] INFO  - Обработка запроса от клиента (IP: 192.168.1.10)...
[2023-10-01 12:01:22] ERROR - Ошибка при обработке запроса: Неверный формат данных. Контактный email: support@example.com
[2023-10-01 12:01:23] INFO  - Отправка ответа клиенту (IP: 192.168.1.10) с кодом ошибки 400.
[2023-10-01 12:02:30] INFO  - Получен новый запрос от клиента (IP: 192.168.1.20).
[2023-10-01 12:02:32] SUCCESS - Запрос успешно обработан. Время ответа: 150ms. Уведомление отправлено на email: user1@example.com
[2023-10-01 12:03:45] INFO  - Периодическая проверка состояния системы...
[2023-10-01 12:03:50] SUCCESS - Все системы функционируют нормально. Отчет отправлен на admin@example.com
[2023-10-01 12:04:15] INFO  - Получен запрос на остановку сервера.
[2023-10-01 12:04:16] INFO  - Остановка службы обработки запросов...
[2023-10-01 12:04:18] SUCCESS - Сервер успешно остановлен.


"""
ip_pattern = r'\b(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\b'
ips = [match.group() for match in re.finditer(ip_pattern, text)]
print("IP адреса:", ips)

time_pattern = r'\d{4}-\d{2}-\d{2} \d{2}:\d{2}:\d{2}'
times = re.findall(time_pattern, text)
print("Временные метки:", times)

uppercase_pattern = r'\b[A-ZА-Я]{2,}\b'
uppercase_words = re.findall(uppercase_pattern, text)
print("\nUPPERCASE слова:", uppercase_words)

email_pattern = r'\b[\w\.-]+@[\w\.-]+\.\w+\b'
protected_text = re.sub(email_pattern, '[EMAIL PROTECTED]', text)
print("\nТекст с защищенными email:", protected_text)